# Homebrew Bundle file - Minimal Setup
# Install everything with: brew bundle

# Taps
#tap "homebrew/cask"
#tap "homebrew/cask-fonts"
tap "civo/tools"
tap "kluctl/tap"

# Essential CLI tools
brew "git"
brew "wget"
brew "fzf"
brew "neovim"
brew "jq"
brew "tree"
brew "htop"
brew "bat"
brew "go"
brew "gawk"
brew "mtr"
brew "pyenv"
brew "tmux"
brew "helm"
brew "gh"
brew "diff-so-fancy"
brew "node"
brew "python@3.12"
brew "act"
brew "go-task"
brew "civo/tools/civo"
brew "yq"
brew "kubectl"
brew "kluctl/tap/kluctl"

# Applications
cask "google-chrome"
cask "iterm2"
cask "visual-studio-code"
cask "docker-desktop"
cask "1password"
cask "obsidian"
cask "slack"
cask "gitkraken-cli"
cask "ollama-app"
cask "proxyman"
cask "spotify"

# Fonts
cask "font-hack-nerd-font"
cask "font-intone-mono-nerd-font"
